СРО_Копия/src/Catalogs/СРО_АдресаЭлектроннойПочтыДляРассылки/СРО_АдресаЭлектроннойПочтыДляРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СРО_АдресаЭлектроннойПочтыДляРассылки</name>
  <attributes>
    <name>АдресЕмэйл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоИндивидуальныеОтчеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеОтчетыДляРассылки</name>
    <attributes>
      <name>КодОтчетности</name>
      <type>
        <types>CatalogRef.СРО_КодыОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтчетовВМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоИндивидуальныеОтчеты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

СРО_Копия/src/Catalogs/СРО_АдресаЭлектроннойПочтыДляРассылки/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ЗаполнитьКодыОтчетовНаСервере(КоличествоОтчетовВМесяц)	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СРО_КодыОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СРО_КодыОтчетов КАК СРО_КодыОтчетов
	|ГДЕ
	|	СРО_КодыОтчетов.Активный
	|	И НЕ СРО_КодыОтчетов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СРО_КодыОтчетов.Код";
	
	
	ДоступныеОтчетыДляРассылки = Объект.ДоступныеОтчетыДляРассылки;
	ДоступныеОтчетыДляРассылки.Очистить();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДоступныеОтчетыДляРассылки.Добавить();
		НоваяСтрока.КодОтчетности = Выборка.Ссылка;
		НоваяСтрока.КоличествоОтчетовВМесяц = КоличествоОтчетовВМесяц;     		
	КонецЦикла;           	

КонецПроцедуры // ЗаполнитьКодыОтчетовНаСервере()


&НаКлиенте
Процедура ОповещениеОкончанияВводаЧисла(ВыбранноеЧисло, ДополнительныеПараметры) Экспорт	
	
	ЗаполнитьКодыОтчетовНаСервере(ВыбранноеЧисло);   
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьКодыОтчетов(Команда)
	
	ОповещениеОкончанияВводаЧисла = Новый ОписаниеОповещения("ОповещениеОкончанияВводаЧисла", ЭтотОбъект);    
		
	КоличествоОтчетовВМесяц = 0;       
		
	ПоказатьВводЧисла(ОповещениеОкончанияВводаЧисла, КоличествоОтчетовВМесяц, "Введите количество отчетов в месяц. Если ограничений на количество отчетов нет, введите 0", 10, 0);
	
КонецПроцедуры
